gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Record.cpp

//普通采集方案记录文件
#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/RM_Record.h"
#include "../DL698/RM_TASK.h"
#include "../MS/msFILE.h"
#include "../MS/MS.h"
#include "../Device/MEMRW.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../STM32F4xx/STM32F4xx_WDG.h"
#include "../Calculate/Calculate.h"

#include "../Terminal698/Terminal_PowerDown.h"
#include "../DL698/EVENT_Record.h"
#include "../DL698/EVENT_CALC.h"
#include "../DL698/DL698_REPORT.h"
#include "../DL698/CALC_TAG.h"

#include "../DL698/DL698_JSON.h"


//方案类型:1=普通采集方案,3=透明方案  文件存储格式
//电能表地址和数据块长度列表区,列表区长度固定 8*NUM_RMmax byte
//6byte 第1个电能表地址
//2byte 第1个电能表数据块长度
//...
//6byte 第NUM_RMmax个电能表地址
//2byte 第NUM_RMmax个电能表数据块长度

//电能表数据块区,长度按实际写入数
//0 7byte 采集启动时标  date_time_s(无数据类型)
//7 7byte 采集成功时标  date_time_s(无数据类型)
//14 7byte 采集存储时标  date_time_s(无数据类型)
//21  采集的CSD  array CSD(有数据类型)
//n  采集的数据(有数据类型)


//方案类型:2=事件采集方案  文件存储格式

void Find_And_CreateNextData(u8 *pout,u32 Len,u32 FileID,u32 YYMD,u16 *pAddr)
{
	u8 *p8;
	u8 *pda;
	u8 OADNUM1;
	u8 OADNUM2;
	u32 i;
	u32 n;
	u32 offset;
	u32 filename;
	u32 datalen;
	msFILE_TypeDef *file;
	ms_Type *ms;
	RecordFileHead_TypeDef* RecordFileHead;//迎噎輫录蟿菥头蟿菥
	ms=(ms_Type *)Get_ms();
	if(0x13f16000==FileID)
	{
		FileID=0x13f11000;
	}else if(0x13f18000==FileID)
	{
		FileID=0x13f13000;
	}
	filename=Get_RecordFileName_JS(FileID,0xFFFFFFFF,0);//虘谭蟿菥幕:色酄?FileID=b31-b28捉懈`褝,b27-b24訅墀`褝,b23-b20咋寓时要`褝,b19-b12蓭媳蹍,b11-b8讒酄氎?b7-b0,袪应圆值为0xF噎示一跇注,pTime私邼咋寓时要=0噎示一跇注;SearchCount=擢始虘谭謩蟿菥蹍0xFFFF噎示論蕪諑蕖烁蹍擢始虘谭;椎軜:0--(FILENAMEmax_FLASH-1)噎示蟿菥諝FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)噎示蟿菥諝RAM,0xffffffff噎示没謷战
	if(filename==0xffffffff)
	{
		return;
	}
	if(filename<FILENAMEmax_FLASH)
	{
		file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
	}
	else
	{
		//file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
		return ;
	}
	if(file->BLOCK_ENTRY==0)
	{
		return;
	}
	//时荬謩筛选
	//YYMD=YYMD_Sub1D_hex(YYMD);//弄弄諅蓵莸1蓵,椎軜莸1鄢謩弄弄諅蓵
	i=(file->save_date_time_s[0]<<16)|(file->save_date_time_s[1]<<24)|(file->save_date_time_s[2]<<8)|(file->save_date_time_s[3]);
	if(YYMD!=i)
	{
		return;
	}
	//骚诨謷战詯私邼,袌褢原4謩私邼呓汛战颅微一俣BUFFo摩
	if(Len>4096)
	{
		return;
	}
	//拷贝一开始的数据到临时空间里面
	MW((u32)pout,(u32)ADDR_DATABUFF,Len);
	n=file->NUM_DATA;
	if((n*sizeof(RecordFileHead_TypeDef))>(LEN_128KDATABUFF-2))
	{
		n=0;
	}
	ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF+2,n*sizeof(RecordFileHead_TypeDef));
	offset=0;
	RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_128KDATABUFF+2);
	for(i=0;i<n;i++)
	{
		if(RecordFileHead->Addr0==pAddr[0])
		{
			if(RecordFileHead->Addr1==pAddr[1])
			{
				if(RecordFileHead->Addr2==pAddr[2])
				{
					break;
				}
			}
		}
		offset+=RecordFileHead->LEN_DATA;
		RecordFileHead++;		
	}
	if(i>=n)
	{//没找到
		MW((u32)ADDR_DATABUFF,(u32)pout,Len);
		return;
	}
	i=RecordFileHead->LEN_DATA;
	if(i>(LEN_128KDATABUFF-(2+NUM_RMmax*sizeof(RecordFileHead_TypeDef))))
	{
		return;
	}
	ms->msfile_read(filename,(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+offset,(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef)),i);
	p8=(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef));
	
	datalen=i;
	//袀摩擢始蹚尧私邼挟
	pda=(u8 *)ADDR_DATABUFF;//詯}俣艢蓾,蹚尧詨一俣698謩帧
	if((datalen+Len)>4096)
	{
		MW((u32)pda,(u32)p8,Len);
		return;
	}
	//褢褌謩私邼挟蹚諝O謩私邼挟鄢摩
	
	MW((u32)p8,(u32)pda+Len,datalen);//两个数据长度连接起来
	
	p8=(u8 *)pda+Len;//p8指胁鄢摩一俣私邼挟
	//袌褢21俣貣逇謩时要呓汛战
	offset=0;
	//袌褢21俣时荬诮脣远去
	MW((u32)pda,(u32)pout,21);
	pda+=21;//没
	p8+=21;
	offset=21;
	Len-=21;
	datalen-=21;
	//6俣貣逇鸭(ROAD
	MW((u32)pda,(u32)pout+offset,8);
	offset+=8;
	pda+=8;
	p8+=8;
	Len-=8;
	datalen-=8;
	//私邼挟謩俣私
	i=pda[0];
	OADNUM1=i;
	n=p8[0];
	OADNUM2=n;
	if((i+n)>0)//私邼挟俣私
	{
		pout[offset++]=i+n-1;//
	}
	Len--;
	datalen--;
	pda++;
	//前摩一俣私邼挟謩私邼呓汛战pout
	MW((u32)pda,(u32)pout+offset,i*4);
	pda+=(i*4);
	offset+=(i*4);
	Len-=(i*4);
	p8++;
	if(n>0)
	{
		p8+=4;//诮脣执私邼殖蕖时荬症俣
		MW((u32)p8,(u32)pout+offset,(n-1)*4);
		p8+=((n-1))*4;
		offset+=((n-1)*4);
		datalen-=(n*4);
	}

	//计算数据域的长度
	datalen=0;
	for(i=0;i<OADNUM1;i++)
	{
		n=Get_DL698DataLen_S(pda+datalen,0);//算出第一个数据的长度
		datalen+=n;
	}
	MW((u32)pda,(u32)pout+offset,datalen);
	offset+=datalen;

	p8+=8;//诮脣执殖蕖时荬私邼挟
	datalen-=8;
	//计算数据域的长度
	datalen=0;
	for(i=0;i<OADNUM2;i++)
	{
		n=Get_DL698DataLen_S(p8+datalen,0);//算出第一个数据的长度
		datalen+=n;
	}
	MW((u32)p8,(u32)pout+offset,datalen);
	
	offset+=datalen;
	//for(i=0;i<offset;i++)
		//myprintf("%02x ", pout[i], 0, 0);
	//myprintf("\n",0,0,0);
}

u32 Get_RecordFileData_Fixed(u32 FileID,u32 FileCount,u16* pAddr,u8* pRSD,u8* pRCSD,u8* pOUT,u32 LEN_OUTmax)//得到记录文件数据;入口:pRSD、pRCSD指向接收的RSD、RCSD(无数据类型)，=0表示不关注;返回:读出的数据长度,0=无数据;使用ADDR_128KDATABUFF
{
	u32 i;
	u32 n;
	u32 offset;
	u32 filename;
	u32 YYMD;
	u32 YYMD1;
	msFILE_TypeDef *file;
	ms_Type *ms;
	RecordFileHead_TypeDef* RecordFileHead;//抄表记录文件头文件
	u8* p8;
	YYMD=0;
	YYMD1=0;
	ms=(ms_Type *)Get_ms();
#if(USER/100)==17//江苏系
	if(Terminal_Router->MinuteCollect==1)
	//if(1)
		filename=Get_RecordFileName_JS(FileID,FileCount,0);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0,相应域值为0xF表示不关注,pTime数据存储时标=0表示不关注;SearchCount=开始搜索的文件号0xFFFF表示从上次结束号开始搜索;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
	else
		filename=Get_RecordFileName(FileID,FileCount,0);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0,相应域值为0xF表示不关注,pTime数据存储时标=0表示不关注;SearchCount=开始搜索的文件号0xFFFF表示从上次结束号开始搜索;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
	#else
		filename=Get_RecordFileName(FileID,FileCount,0);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0,相应域值为0xF表示不关注,pTime数据存储时标=0表示不关注;SearchCount=开始搜索的文件号0xFFFF表示从上次结束号开始搜索;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
	#endif	
	if(filename==0xffffffff)
	{
		return 0;
	}
	if(filename<FILENAMEmax_FLASH)
	{
		file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
	}
	else
	{
		file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
	}
	if(file->BLOCK_ENTRY==0)
	{
		return 0;
	}
	switch(pRSD[0])
	{
		case 0:
//不选择       [0]  NULL
			break;
		case 1:
//Selector1∷=SEQUENCE
//{
//  对象属性描述符  OAD，
//  数值            Data
//}
			pRSD++;
			i=(pRSD[0]<<24)|(pRSD[1]<<16)|(pRSD[2]<<8)|pRSD[3];
			switch(i)
			{
				case 0x20210200://数据冻结时间
					pRSD+=4;
					if(pRSD[0]!=DataType_date_time_s)
					{//数值Data=空
						return 0;
					}
					pRSD+=1;
					//数值Data=date_time_s
					for(i=0;i<6;i++)
					{//秒不比较
						if(pRSD[i]!=file->save_date_time_s[i])
						{
							return 0;
						}
					}
					break;
				//case 0x40000200://日期时间
				default:
					return 0;
			}
			break;
		case 2:
//Selector2∷=SEQUENCE
//{
//  对象属性描述符  OAD，
//  起始值          Data，
//  结束值          Data，
//  数据间隔        Data
//}
			pRSD++;
			i=(pRSD[0]<<24)|(pRSD[1]<<16)|(pRSD[2]<<8)|pRSD[3];
			switch(i)
			{
				case 0x20210200://数据冻结时间
					pRSD+=5;
					i=Compare_DL698DataString(file->save_date_time_s,pRSD,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
					if(i!=0)
					{//不相同
						return 0;
					}
					pRSD+=8;
					i=Compare_DL698DataString(file->save_date_time_s,pRSD,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
					if(i!=2)
					{//时间>=结束值
						return 0;
					}
					break;
				default:
					return 0;
			}
			break;
		case 3:
//Selector3∷=SEQUENCE OF Selector2
			pRSD+=2;
			i=(pRSD[0]<<24)|(pRSD[1]<<16)|(pRSD[2]<<8)|pRSD[3];
			switch(i)
			{
				case 0x20210200://数据冻结时间
					pRSD+=5;
					i=Compare_DL698DataString(file->save_date_time_s,pRSD,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
					if(i!=0)
					{//不相同
						return 0;
					}
					pRSD+=8;
					i=Compare_DL698DataString(file->save_date_time_s,pRSD,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
					if(i!=2)
					{//时间>=结束值
						return 0;
					}
					break;
				default:
					return 0;
			}
			break;
		case 4:
//Selector4∷=SEQUENCE
//{
//  采集启动时间  date_time_s，
//  电能表集合    MS
//}
			if((file->FILEID&0xff)!=0)
			{//文件分类!=0
				return 0;
			}
			//取7byte 采集启动时标  date_time_s(无数据类型)
//			ms->msfile_read(filename,NUM_RMmax*sizeof(RecordFileHead_TypeDef),(u8*)ADDR_DATABUFF,7);
//			p8=(u8*)ADDR_DATABUFF;
//			pRSD++;
//			for(i=0;i<6;i++)//秒不比较
//			{
//				if(pRSD[i]!=p8[i])
//				{
//					return 0;
//				}
//			}
			pRSD++;
			for(i=0;i<6;i++)//秒不比较
			{
				if(pRSD[i]!=file->start_date_time_s[i])
				{
					return 0;
				}
			}
			break;
		case 5:
//Selector5∷=SEQUENCE
//{
//  采集存储时间  date_time_s，
//  电能表集合    MS
//}
#if (USER/100==17)	
			if(((FileID>>24)!=0x1E)&&(Terminal_Router->MinuteCollect==1))//月冻结数据
			{
				pRSD++;
				i=(pRSD[0]<<16)|(pRSD[1]<<24)|(pRSD[2]<<8)|(pRSD[3]);
				i=YYMD_Sub1D_hex(i);//年年月日减1日,返回减1后的年年月日
				n=(file->save_date_time_s[0]<<16)|(file->save_date_time_s[1]<<24)|(file->save_date_time_s[2]<<8)|(file->save_date_time_s[3]);
				if(i!=n)
				{
					return 0;
				}
			}
			else
			{
				pRSD++;
				for(i=0;i<6;i++)//秒不比较
				{
					if(pRSD[i]!=file->save_date_time_s[i])
					{
						return 0;
					}
				}
			}
#else
			pRSD++;
			for(i=0;i<6;i++)//秒不比较
			{
				if(pRSD[i]!=file->save_date_time_s[i])
				{
					return 0;
				}
			}
#endif
			break;
		case 6:
//Selector6∷=SEQUENCE
//{
//  采集启动时间起始值  date_time_s，
//  采集启动时间结束值  date_time_s，
//  时间间隔            TI，
//  电能表集合          MS
//}
			if((file->FILEID&0xff)!=0)
			{//文件分类!=0
				return 0;
			}
			//取7byte 采集启动时标  date_time_s(无数据类型)
//			ms->msfile_read(filename,NUM_RMmax*sizeof(RecordFileHead_TypeDef),(u8*)ADDR_DATABUFF,7);
//			p8=(u8*)ADDR_DATABUFF;
//			pRSD++;
//			i=Compare_DL698DataString(p8,pRSD,6);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
//			if(i!=0)
//			{//不相同
//				return 0;
//			}
//			pRSD+=7;
//			i=Compare_DL698DataString(p8,pRSD,6);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
//			if(i!=2)
//			{//时间>=结束值
//				return 0;
//			}
			pRSD++;
			i=Compare_DL698DataString(file->start_date_time_s,pRSD,6);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
			if(i!=0)
			{//不相同
				return 0;
			}
			pRSD+=7;
			i=Compare_DL698DataString(file->start_date_time_s,pRSD,6);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
			if(i!=2)
			{//时间>=结束值
				return 0;
			}
			break;
		case 7:
//Selector7∷=SEQUENCE
//{
//  采集存储时间起始值  date_time_s，
//  采集存储时间结束值  date_time_s，
//  时间间隔            TI，
//  电能表集合          MS
//}
//		#if (USER%100)!=0//不是过台体测试
			//if(((FileID>>20)==0x136)||((FileID>>20)==0x101))
			if(((FileID>>24)==0x13)||((FileID>>24)==0x10))
			{//曲线或实时数据
				pRSD++;
				
			#if(USER/100)==17//
			if(Terminal_Router->MinuteCollect==1)
			//if(1)
			{
				YYMD=(pRSD[0]<<16)|(pRSD[1]<<24)|(pRSD[2]<<8)|(pRSD[3]);
				YYMD1=YYMD;
				//i=YYMD_Sub1D_hex(YYMD);//年年月日减1日,返回减1后的年年月日
				n=(file->save_date_time_s[0]<<16)|(file->save_date_time_s[1]<<24)|(file->save_date_time_s[2]<<8)|(file->save_date_time_s[3]);
				if(n<YYMD)
				{				
					return 0;
				}
				if(n==YYMD)
				{
					YYMD=(pRSD[4]<<8)|(pRSD[5]);
					n=(file->save_date_time_s[4]<<8)|(file->save_date_time_s[5]);
					if(n<YYMD)
					{
						return 0;
					}
				}
				//符合召测日冻结的要求
				pRSD+=7;
				YYMD=(pRSD[0]<<16)|(pRSD[1]<<24)|(pRSD[2]<<8)|(pRSD[3]);
				n=(file->save_date_time_s[0]<<16)|(file->save_date_time_s[1]<<24)|(file->save_date_time_s[2]<<8)|(file->save_date_time_s[3]);
				if(n>YYMD)
				{
					return 0;
				}
				if(n==YYMD)
				{
					YYMD=(pRSD[4]<<8)|(pRSD[5]);
					n=(file->save_date_time_s[4]<<8)|(file->save_date_time_s[5]);
					if(n>=YYMD)
					{
						return 0;
					}
				}
			}else
			{
				i=Compare_DL698DataString(file->save_date_time_s,pRSD,6);//?????(??????),p1?p2??RAM?,??:0=??,1=???p1>p2,2=???p1<p2
				if(i!=0)
				{
					pYYMDHMS_AddS_hex(pRSD,60);
					i=Compare_DL698DataString(file->save_date_time_s,pRSD,6);//?????(??????),p1?p2??RAM?,??:0=??,1=???p1>p2,2=???p1<p2
					pYYMDHMS_SubS_hex(pRSD,60);
					if(i!=0)
					{//
						return 0;
					}
				}
//				i=Compare_DL698DataString(file->save_date_time_s,pRSD,6);//?????(??????),p1?p2??RAM?,??:0=??,1=???p1>p2,2=???p1<p2
//				if(i!=0)
//				{
//					pYYMDHMS_AddS_hex(pRSD,3600);
//					i=Compare_DL698DataString(file->save_date_time_s,pRSD,6);//?????(??????),p1?p2??RAM?,??:0=??,1=???p1>p2,2=???p1<p2
//					pYYMDHMS_SubS_hex(pRSD,3600);
//					if(i!=0)
//					{//
//						return 0;
//					}
//				}
				
			#else
				i=Compare_DL698DataString(file->save_date_time_s,pRSD,6);//?????(??????),p1?p2??RAM?,??:0=??,1=???p1>p2,2=???p1<p2
			#endif
				if(i!=0)
				{//不相同
					return 0;
				}
				pRSD+=7;
				i=Compare_DL698DataString(file->save_date_time_s,pRSD,6);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
				if(i!=2)
				{//时间>=结束值
					return 0;
				}
			}
			}
			else
			{//日或月冻结
				//if((FileID>>20)==0x123)
				if((FileID>>24)==0x12)
				{//日冻结
					pRSD++;
					i=Compare_DL698DataString(file->save_date_time_s,pRSD,4);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
					if(i!=0)
					{//年月日不同
						return 0;
					}
				}
			#if(USER/100)==17//江苏系
				else if((FileID>>24)==0x1F)//结算日冻结
				{
					pRSD++;
					i=(pRSD[0]<<16)|(pRSD[1]<<24)|(pRSD[2]<<8)|(pRSD[3]);
					i=YYMD_Add1D_hex(i);//年年月日减1日,返回减1后的年年月日
					n=(file->save_date_time_s[0]<<16)|(file->save_date_time_s[1]<<24)|(file->save_date_time_s[2]<<8)|(file->save_date_time_s[3]);
					if(i!=n)
					{
						return 0;
					}
				}
			#endif
				else
				{//月冻结
					pRSD++;
					i=Compare_DL698DataString(file->save_date_time_s,pRSD,3);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
					if(i!=0)
					{//年月不同
						return 0;
					}
				}
			}
//		#else
//			pRSD++;
//			i=Compare_DL698DataString(file->save_date_time_s,pRSD,6);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
//			if(i!=0)
//			{//不相同
//				return 0;
//			}
//			pRSD+=7;
//			i=Compare_DL698DataString(file->save_date_time_s,pRSD,6);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
//			if(i!=2)
//			{//时间>=结束值
//				return 0;
//			}
//		#endif
			break;
		case 8:
//Selector8∷=SEQUENCE
//{
//  采集成功时间起始值  date_time_s，
//  采集成功时间结束值  date_time_s，
//  时间间隔            TI，
//  电能表集合          MS
//}
			if((file->FILEID&0xff)!=0)
			{//文件分类!=0
				return 0;
			}
			//取7byte 采集成功时间  date_time_s(无数据类型)
//			ms->msfile_read(filename,(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+7,(u8*)ADDR_DATABUFF,7);
//			p8=(u8*)ADDR_DATABUFF;
//			pRSD++;
//			i=(pRSD[7+7+1]<<8)+pRSD[7+7+2];
//			if(i==0)
//			{//特例:TI=0;忇议一致性测试时需至少返回1个数据
//				i=Compare_DL698DataString(p8,pRSD,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
//				if(i==2)
//				{//采集成功时间<起始值
//					return 0;
//				}
//				i=Compare_DL698DataString(p8,pRSD+7,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
//				if(i!=2)
//				{//采集成功时间>=结束值
//					return 0;
//				}
//				break;
//			}
//			switch(pRSD[7+7])
//			{
//				case 0://  秒      （0），
//					n=7;
//					break;
//				case 1://分      （1），
//					n=6;
//					break;
//				case 2://时      （2），
//					n=5;
//					break;
//				case 3://日      （3），
//					n=4;
//					break;
//				case 4://月      （4），
//					n=3;
//					break;
//				case 5://年      （5）
//					n=2;
//					break;
//				default:
//					return 0;
//			}
//			i=Compare_DL698DataString(p8,pRSD,n);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
//			if(i!=0)
//			{//不相同
//				return 0;
//			}
//			i=Compare_DL698DataString(p8,pRSD+7,n);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
//			if(i!=2)
//			{//采集成功时间>=结束值
//				return 0;
//			}
//			break;

