gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Record.cpp
			n=file->NUM_DATA;
			if((n*sizeof(RecordFileHead_TypeDef))>(LEN_128KDATABUFF-2))
			{
				n=0;
			}
			ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF+2,n*sizeof(RecordFileHead_TypeDef));
			offset=0;
			RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_128KDATABUFF+2);
			for(i=0;i<n;i++)
			{
				if(RecordFileHead->Addr0==pAddr[0])
				{
					if(RecordFileHead->Addr1==pAddr[1])
					{
						if(RecordFileHead->Addr2==pAddr[2])
						{
							break;
						}
					}
				}
				offset+=RecordFileHead->LEN_DATA;
				RecordFileHead++;
			}
			if(i>=n)
			{//没找到
				return 0;
			}
			i=RecordFileHead->LEN_DATA;
			if(i>(LEN_128KDATABUFF-(2+NUM_RMmax*sizeof(RecordFileHead_TypeDef))))
			{
				return 0;
			}
			ms->msfile_read(filename,(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+offset,(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef)),i);
			p8=(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+7;//7byte 采集成功时间
		
			pRSD++;
			i=(pRSD[7+7+1]<<8)+pRSD[7+7+2];
			if(i==0)
			{//特例:TI=0;忇议一致性测试时需至少返回1个数据
				i=Compare_DL698DataString(p8,pRSD,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
				if(i==2)
				{//采集成功时间<起始值
					return 0;
				}
				i=Compare_DL698DataString(p8,pRSD+7,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
				if(i!=2)
				{//采集成功时间>=结束值
					return 0;
				}
				i=Get_RecordFileData_RCSD(pRCSD,(u8*)&RecordFileHead->Addr0,(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef)),pOUT,LEN_OUTmax,ALLDATANULLSEL);//记录表的列选择;入口:pRCSD指向行选择的RCSD(无数据类型),pTSA,pRecord指向每只表记录地址和数据块开始,p8out指向数据发送缓冲;出口;记录选择数据的长度,0=没记录或错误
				return i;
			}
			switch(pRSD[7+7])
			{
				case 0://  秒      （0），
					n=7;
					break;
				case 1://分      （1），
					n=6;
					break;
				case 2://时      （2），
					n=5;
					break;
				case 3://日      （3），
					n=4;
					break;
				case 4://月      （4），
					n=3;
					break;
				case 5://年      （5）
					n=2;
					break;
				default:
					return 0;
			}
			i=Compare_DL698DataString(p8,pRSD,n);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
			if(i!=0)
			{//不相同
				return 0;
			}
			i=Compare_DL698DataString(p8,pRSD+7,n);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
			if(i!=2)
			{//采集成功时间>=结束值
				return 0;
			}
			i=Get_RecordFileData_RCSD(pRCSD,(u8*)&RecordFileHead->Addr0,(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef)),pOUT,LEN_OUTmax,ALLDATANULLSEL);//记录表的列选择;入口:pRCSD指向行选择的RCSD(无数据类型),pTSA,pRecord指向每只表记录地址和数据块开始,p8out指向数据发送缓冲;出口;记录选择数据的长度,0=没记录或错误
			return i;
			
		case 9:
//Selector9∷=SEQUENCE
//{
//  上第n次记录  unsigned
//}
			return 0;
		case 10:
//Selector10∷=SEQUENCE
//{
//上n条记录  unsigned，
//电能表集合  MS
//}
			break;//查找先用RCSDtoID，只要找到文件就有效
		default:
			return 0;
	}
		
	n=file->NUM_DATA;
	if((n*sizeof(RecordFileHead_TypeDef))>(LEN_128KDATABUFF-2))
	{
		n=0;
	}
	ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF+2,n*sizeof(RecordFileHead_TypeDef));
	offset=0;
	RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_128KDATABUFF+2);
	for(i=0;i<n;i++)
	{
		if(RecordFileHead->Addr0==pAddr[0])
		{
			if(RecordFileHead->Addr1==pAddr[1])
			{
				if(RecordFileHead->Addr2==pAddr[2])
				{
					break;
				}
			}
		}
		offset+=RecordFileHead->LEN_DATA;
		RecordFileHead++;
		
	}
	if(i>=n)
	{//没找到
		return 0;
	}
	i=RecordFileHead->LEN_DATA;
	if(i>(LEN_128KDATABUFF-(2+NUM_RMmax*sizeof(RecordFileHead_TypeDef))))
	{
		return 0;
	}
	ms->msfile_read(filename,(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+offset,(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef)),i);
	if(YYMD1&&Terminal_Router->MinuteCollect==1)
	//if(YYMD1)//江苏会用到这个变量
	{
		p8=(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef));
		#ifdef DEBUG_JSON
		for(i=0;i<600;i++)
			myprintf("%02x ", p8[i], 0, 0);
		myprintf("\n",0,0,0);
		#endif
		Find_And_CreateNextData((u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef)),i,FileID,YYMD1,pAddr);	
		i=Get_RecordFileData_RCSD(pRCSD,(u8*)pAddr,(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef)),pOUT,LEN_OUTmax,ALLDATANULLSEL);//记录表的列选择;入口:pRCSD指向行选择的RCSD(无数据类型),pTSA,pRecord指向每只表记录地址和数据块开始,p8out指向数据发送缓冲;出口;记录选择数据的长度,0=没记录或错误
		return i;
	}
	i=Get_RecordFileData_RCSD(pRCSD,(u8*)&RecordFileHead->Addr0,(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef)),pOUT,LEN_OUTmax,ALLDATANULLSEL);//记录表的列选择;入口:pRCSD指向行选择的RCSD(无数据类型),pTSA,pRecord指向每只表记录地址和数据块开始,p8out指向数据发送缓冲;出口;记录选择数据的长度,0=没记录或错误
	return i;
}

u32 GET_RecordFileData(u32 FileID,u32 FileCount,u16* pAddr,u8* pRSD,u8* pRCSD,u8* pOUT,u32 LEN_OUTmax)//謨战輫录蟿菥私邼;色酄?pRSDbpRCSD指胁迵藭謩RSDbRCSD(蠟私邼`褝)矛=0噎示一跇注;椎軜:讈远謩私邼婴讏,0=蠟私邼;使詢ADDR_128KDATABUFF
{
	u32 LEN;

	WWDT_Enable_Feed(WDTTimerOutVal);//諍循叽膮俜蹗喂俜
	Comm_Ram->msFILESearchCount=0;
	if(Terminal_Router->MinuteCollect==1)
	//if(1)
	{
		while(Comm_Ram->msFILESearchCount<(recordFILENAMEmax_FLASH))
		{
			LEN=Get_RecordFileData_Fixed(FileID,FileCount,pAddr,pRSD,pRCSD,pOUT,LEN_OUTmax);//謨战輫录蟿菥私邼
			if(LEN)
			{
				return LEN;
			}
		}
	}else
	{
		while(Comm_Ram->msFILESearchCount<(recordFILENAMEmax_FLASH+recordFILENAMEmax_RAM))
		{
			LEN=Get_RecordFileData_Fixed(FileID,FileCount,pAddr,pRSD,pRCSD,pOUT,LEN_OUTmax);//謨战輫录蟿菥私邼
			if(LEN)
			{
				return LEN;
			}
		}
	}	
	
	return 0;
}



u32 DEPTH_RecordFile(u32 PORTn)//记录文件存储深度;返回:存储深度
{
	u32 no;
	u8 *p8;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	no=UARTCtrl->TaskID&0xff;//方案号
	switch((UARTCtrl->TaskID>>24)&0xf)//方案类型
	{
		case 1://普通采集方案 （1）
			if(no>=NUMmax_6014)
			{
				no=0;
			}
			p8=(u8*)ADDR_6014_SDRAM+(no*LENper_6014);
			p8=Get_Element(p8,2,0,LENper_6014);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8)
			{
				return (p8[1]<<8)+p8[2];
			}
			return 0;
		case 2://事件采集方案 （2）
			if(no>=NUMmax_6016)
			{
				no=0;
			}
			p8=(u8*)ADDR_6016_SDRAM+(no*LENper_6016);
			p8=Get_Element(p8,5,0,LENper_6016);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8)
			{
				return (p8[1]<<8)+p8[2];
			}
			return 0;
		case 3://透明方案     （3）
			if(no>=NUMmax_6018)
			{
				no=0;
			}
			p8=(u8*)ADDR_6018+(no*LENper_6018);
			p8=Get_Element(p8,4,0,LENper_6018);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8)
			{
				return (p8[1]<<8)+p8[2];
			}
			return 0;
		case 4://上报方案     （4）
		case 5://脚本方案     （5）
			return 0;
		default:
			return 0;
	}
}

