gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Record.cpp
void CountInc_RecordFile(u32 PORTn)//当有文件计数=0时,全部记录文件文件计数+1,删除达到记录深度的文件
{
	u32 i;
	u32 FileID;
	u32 set_depth;
	u32 filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	
	FileID=Get_FileID(PORTn);//UART各任务的FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类
	ms=(ms_Type *)Get_ms();
	set_depth=DEPTH_RecordFile(PORTn);//记录文件存储深度;入口:TaskID=UARTCtrl->TaskID;返回:存储深度
	if(set_depth<=1)
	{
		set_depth=2;//最小值
	}
	if(set_depth>0xfffe)
	{
		set_depth=0xfffe;//最大值
	}
	set_depth--;
	Comm_Ram->msFILESearchCount=0;
	while(1)
	{
		filename=Get_RecordFileName(FileID,0,0);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类,相应域值为0xFF表示不关注,FileCount文件计数=0xFFFFFFFF表示不关注,pTime数据存储时标=0表示不关注;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
		if(filename==0xffffffff)
		{//没找到
			return;
		}
		if(filename<recordFILENAMEmax_FLASH)
		{
			file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
		}
		else
		{
			file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-recordFILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
		}
		if(file->FILECOUNT==0)
		{
			break;
		}
	}
	//有计数=0的文件
	Comm_Ram->msFILEchange=0;//文件管理数据变化:0=变化,!=没变化
	Comm_Ram->msFILESearchCount=0;
	while(1)
	{
		filename=Get_RecordFileName(FileID,0xffffffff,0);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类,相应域值为0xFF表示不关注,FileCount文件计数=0xFFFFFFFF表示不关注,pTime数据存储时标=0表示不关注;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
		if(filename==0xffffffff)
		{//没找到
			return;
		}
		if(filename<recordFILENAMEmax_FLASH)
		{
			file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
		}
		else
		{
			file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-recordFILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
		}
		if(file->FILECOUNT>=set_depth)
		{
			i=filename;
			if(i>=recordFILENAMEmax_FLASH)
			{
				i-=recordFILENAMEmax_FLASH;
				i+=FILENAMEmax_FLASH;
			}
			ms->msfile_Delete(i);
		}
		else
		{
			file->FILECOUNT++;
		}
	}
}

u32 AutoDelete_ErrID_RecordFile(void)//自动删除任务已不存在的记录文件;返回:0=没删除,1=有删除
{
	u32 i;
	u32 filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	u32 FileID;
	u32 Delete;
	u8* p8;
	u32 id;
	
	Delete=0;
	ms=Get_ms();
	
	file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
	for(filename=0;filename<(recordFILENAMEmax_FLASH+recordFILENAMEmax_RAM);filename++)
	{
		if(filename==recordFILENAMEmax_FLASH)
		{
			file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage);
		}
		if(file->BLOCK_ENTRY)
		{
			FileID=file->FILEID;
			switch(FileID&0xff)//文件分类
			{
				case 1://1.数据冻结
				case 2://2.事件记录
				case 3://3.所有搜表结果
				case 4://4.跨台区搜表结果
				case 5://5.DL645电能表主动上报
				default:
					file++;
					continue;
				case 0://普通采集方案记录,全事件采集方案记录
					i=FileID>>28;
					if(i==1)
					{//1=普通采集方案
						FileID>>=12;
						for(id=0;id<NUMmax_6012_2;id++)
						{
							i=IDtoFileID(id);//入口:任务号id,返回:文件存储FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类;无效id返回=0
							i>>=12;
							if(i==FileID)
							{
								break;
							}
						}
						if(id>=NUMmax_6012_2)
						{//没相关任务
							i=filename;
							if(i>=recordFILENAMEmax_FLASH)
							{
								i-=recordFILENAMEmax_FLASH;
								i+=FILENAMEmax_FLASH;
							}
							ms->msfile_Delete(i);
							Delete=1;
						}
					}
					else
					{//全事件采集方案记录,任务号相关
					#if FileID_2xx==0//0=否,1=是;方案类型_采集类型_存储时标类型=2xx(事件采集方案)文件标识区分任务ID号
						#error
					#endif
//#define MeterAutoReportTaskID     0x02300000;//电表主动上报约定任务ID:b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
//FILEID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类
						if(FileID==MeterAutoReportFileID_DL645)
						{
							break;
						}
						if(FileID==MeterAutoReportFileID_DL698)
						{
							break;
						}
						if(FileID==MeterAutoReportFileID_3011)
						{
							break;
						}
						FileID>>=12;
						FileID&=0xff;//任务号
						p8=(u8*)ADDR_6012_2_SDRAM+(FileID*LENper_6012_2);
						if(p8[0]!=DataType_structure)
						{
							i=filename;
							if(i>=recordFILENAMEmax_FLASH)
							{
								i-=recordFILENAMEmax_FLASH;
								i+=FILENAMEmax_FLASH;
							}
							ms->msfile_Delete(i);
							Delete=1;
						}
					}
					break;
			}
		}
		file++;
	}
	return Delete;
}

//=================
//交采数据,1分钟,15分钟曲线数据就保存一天,日冻结保存3天,月冻结2个月

//一共有1683个时间点 1分钟1440,15分钟96,日冻结3,月冻结2
//1440+96+3+2=1541	//一天一共需要那么多个点保存分钟冻结 //因为要过第二天打包 再加70个点 1541+70=1611
//1683-1611 =72    //一天剩下那么多个点
//=================
u32 AutoDeleteFile_SeletTime(u32 FileID,u8 *ptime)
{
	u32 i;
	u32 ret;

	u32 YYMD1;
	u32 YYMD2;

	ret=0;
	i=Check_pYYMDHMS_hex(JSON->Lastrealtime);
	if(i)
	{
		return ret;
	}
	//根据FileID来删除不同的文件
	switch(FileID)
	{
		case 0x13f12000://实时的文件打包完之后会删除
		case 0x13f17000:
			break;
		case 0x13f16000://日冻结
		case 0x13f11000:
			YYMD1=0;
			YYMD1=(JSON->Lastrealtime[0]<<8)|(JSON->Lastrealtime[1]<<16)|(JSON->Lastrealtime[2]);
			YYMD2=0;
			YYMD2=(ptime[0]<<8)|(ptime[1]<<16)|(ptime[2]);
			if(YYMD1>YYMD2)//前面的时间比后面的时间大就说明已经过了一个月了,这个文件要删除
			{
				ret=1;
			}
		break;
		case 0x13f18000://月冻结
		case 0x13f13000:
			//YYMD1=(JSON->Lastrealtime[0]<<16)|(JSON->Lastrealtime[1]<<8)|JSON->Lastrealtime[2];
			//YYMD1=YYM_SubM_hex(YYMD1,12);//年年月日减1日,返回减1后的年年月日
			//YYMD2=(ptime[0]<<16)|(ptime[1]<<8)|ptime[2];
			YYMD1=(JSON->Lastrealtime[0]<<16)|(JSON->Lastrealtime[1]<<8);
			//YYMD1=YYM_SubM_hex(YYMD1,12);//年年月日减1日,返回减1后的年年月日
			YYMD2=(ptime[0]<<16)|(ptime[1]<<8);
			if(YYMD1>YYMD2)//年份大于文件年份就删除
			{
				ret=1;
			}
		break;
		case 0x13f19000://15分钟冻结
			YYMD1=(JSON->Lastrealtime[0]<<16)|(JSON->Lastrealtime[1]<<24)|(JSON->Lastrealtime[2]<<8)|JSON->Lastrealtime[3];
			YYMD2=(ptime[0]<<16)|(ptime[1]<<24)|(ptime[2]<<8)|ptime[3];
			
			if((JSON->Lastrealtime[4]*60+JSON->Lastrealtime[5])<=(60+10))//如果是在1点10分之后那就删除,不然不删除因为还没有打包
			{
				YYMD1=YYMD_Sub1D_hex(YYMD1);//年年月日减1日,返回减1后的年年月日
				if(YYMD1>YYMD2)
				{
					ret=1;
				}
			}else
			{
				if(YYMD1!=YYMD2)
				{
					ret=1;
				}
			}
		break;
		case 0x13f22000://1分钟冻结
			YYMD1=(JSON->Lastrealtime[0]<<16)|(JSON->Lastrealtime[1]<<24)|(JSON->Lastrealtime[2]<<8)|JSON->Lastrealtime[3];
			YYMD2=(ptime[0]<<16)|(ptime[1]<<24)|(ptime[2]<<8)|ptime[3];
			
