gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Record.cpp
			if((JSON->Lastrealtime[4]*60+JSON->Lastrealtime[5])<=(60+10))//如果是在1点10分之后那就删除,不然不删除因为还没有打包
			{
				YYMD1=YYMD_Sub1D_hex(YYMD1);//年年月日减1日,返回减1后的年年月日
				if(YYMD1>YYMD2)
				{
					ret=1;
				}
			}else
			{
				if(YYMD1!=YYMD2)
				{
					ret=1;
				}
			}
			break;
		case 3://搜表结果不删除
		case 4:
			break;
		default:
			ret=1;//其他的什么杂七杂八的都删除
		break;
	}
	return ret;
}

u32 AutoDeleteFile_SeletFileID(u32 FileID)
{
	u32 ret;
	ret=0;
	//根据FileID来删除不同的文件
	switch(FileID)
	{
		case 0x13f12000:
		case 0x13f17000:
		case 0x13f16000://日冻结
		case 0x13f11000:
		case 0x13f18000://月冻结
		case 0x13f13000:
		case 0x13f19000://15分钟冻结
		case 0x13f22000://1分钟冻结
		case 3://搜表结果不删除
		case 4:
			break;
		default:
			ret=1;//其他的什么杂七杂八的都删除
		break;
	}
	return ret;
}

u32 AutoDeleteFile_RealData(u32 FileID)
{
	u32 ret;
	ret=0;
	//根据FileID来删除不同的文件
	switch(FileID)
	{
		case 0x13f12000:
		case 0x13f17000:
			ret=1;//其他的什么杂七杂八的都删除
		break;
	}
	return ret;
}

u32 AutoDelet_JSData(u32 FileID)
{
	u32 ret;
	ret=0;
	switch(FileID)
	{
		case 0x13f16000://日冻结
		case 0x13f11000:
		case 0x13f18000://月冻结
		case 0x13f13000:
		case 0x13f19000://15分钟冻结
		case 0x13f22000://1分钟冻结
		case 0x13f12000:
		case 0x13f17000:
			ret=1;
			break;
	}
	return ret;
}

u32 AutoDeleteFile(u32 filename)//自动删除记录文件(自动减少存储深度);入口:写入文件时空间不够的文件名,以判别是RAM还是FLASH空间不够;返回:0=没删除,1=有删除
{
	u32 i;
	u32 FileCount;
	u32 FileID;
	msFILE_TypeDef *file;
	ms_Type *ms;
	ms=Get_ms();
	FileCount=0;	
	if(filename<FILENAMEmax_FLASH)
	{//FLASH
	if(Terminal_Router->MinuteCollect==1)//载波那边决定这个值
	{
		//先删除不是江苏需要的数据
		file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);	
		for(filename=0;filename<recordFILENAMEmax_FLASH;filename++)
		{
			if(file->BLOCK_ENTRY)
			{
				//i=file->FILECOUNT;
				FileID=file->FILEID;
				i=AutoDeleteFile_SeletFileID(FileID);
				if(i)
				{
					ms->msfile_Delete(filename);
					FileCount=1;
					break;
				}
			}
			file++;
		}
		if(FileCount)
		{
			return 1;
		}
		//再删除按照时间排序数据
		file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);	
		for(filename=0;filename<recordFILENAMEmax_FLASH;filename++)
		{
			if(file->BLOCK_ENTRY)
			{
				//i=file->FILECOUNT;
				FileID=file->FILEID;
				i=AutoDeleteFile_SeletTime(FileID,file->save_date_time_s);
				if(i)
				{
					ms->msfile_Delete(filename);
					FileCount=1;
					break;
				}
			}
			file++;
		}
		if(FileCount)
		{
			return 1;
		}
		//再删除实时数据
		file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);	
		for(filename=0;filename<recordFILENAMEmax_FLASH;filename++)
		{
			if(file->BLOCK_ENTRY)
			{
				//i=file->FILECOUNT;
				FileID=file->FILEID;
				i=AutoDeleteFile_RealData(FileID);
				if(i)
				{
					ms->msfile_Delete(filename);
					FileCount=1;
					break;
				}
			}
			file++;
		}
		if(FileCount)
		{
			return 1;
		}
	
		return 0;//返回:0=没删除,1=有删除
	}else
	{
		//查当前最大的文件计数
		file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
		for(filename=0;filename<recordFILENAMEmax_FLASH;filename++)
		{
			if(file->BLOCK_ENTRY)
			{
				i=file->FILECOUNT;
				FileID=file->FILEID;
				#if(USER/100)==17//江苏
				if(AutoDelet_JSData(FileID))//Flash里面还有没有原来江苏的数据
				{
					ms->msfile_Delete(filename);
					return 1;//有删除
				}
				#endif
				//if((FileID>>20)==0x136)
				if((FileID>>24)==0x13)
				{//曲线文件
				#if (USER/100)==9//河南每5分钟1个点
					if(i<=(3*96*3))//至少3天
					{
						i=0;
					}
				#else
					if(i<=(3*96))//至少3天
					{
						i=0;
					}
				#endif
				}
				if(i>FileCount)
				{
					FileCount=i;
				}
			}
			file++;
		}
//删除最大文件计数的文件
		if(FileCount<=1)
		{//最小计数1
			return 0;//返回:0=没删除,1=有删除
		}
		file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
		for(filename=0;filename<recordFILENAMEmax_FLASH;filename++)
		{
			if(file->BLOCK_ENTRY)
			{
				i=file->FILECOUNT;
				FileID=file->FILEID;
				//if((FileID>>20)==0x136)
				if((FileID>>24)==0x13)
				{//曲线文件
				#if (USER/100)==9//河南每5分钟1个点
					if(i<=(3*96*3))//至少3天
					{
						i=0;
					}
				#else
					if(i<=(3*96))//至少3天
					{
						i=0;
					}
				#endif
				}
				if(i>=FileCount)
				{
					ms=Get_ms();
					ms->msfile_Delete(filename);
					return 1;//返回:0=没删除,1=有删除
				}
			}
			file++;
		}
		return 0;//返回:0=没删除,1=有删除
	}
	}
	else
	{//RAM
//查当前最大的文件计数
		file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage);
		for(filename=0;filename<recordFILENAMEmax_RAM;filename++)
		{
			if(file->BLOCK_ENTRY)
			{
				i=file->FILECOUNT;
				if(i>FileCount)
				{
					FileCount=i;
				}
			}
			file++;
		}
//删除最大文件计数的文件
		if(FileCount<=1)
		{//最小计数1
			return 0;//返回:0=没删除,1=有删除
		}
		file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage);
		for(filename=0;filename<recordFILENAMEmax_RAM;filename++)
		{
			if(file->BLOCK_ENTRY)
			{
				i=file->FILECOUNT;
				if(i>=FileCount)
				{
					filename+=FILENAMEmax_FLASH;
					ms=Get_ms();
					ms->msfile_Delete(filename);
					return 1;//返回:0=没删除,1=有删除
				}
			}
			file++;
		}
		return 0;//返回:0=没删除,1=有删除
	}
}

void log_Flash(void)
{
	u32 filename;
	u32 FileID;
	msFILE_TypeDef *file;
	u32 SLFDATA=0;
	u32 RealMIN=0;
	u32 Frz1Min=0;
	u32 Frz15Min=0;
	u32 FrzDAY=0;
	u32 FrzMON=0;
	u32 NotFrz=0;
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:文件最大存储空间recordFILENAMEmax_FLASH=%d\n",(u32)&__func__,(u32)__LINE__,recordFILENAMEmax_FLASH);
	#endif
	file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
	for(filename=0;filename<recordFILENAMEmax_FLASH;filename++)
	{
		if(file->BLOCK_ENTRY)
		{
			FileID=file->FILEID;
			switch(FileID)
			{
				case 0x13f05000://交采数据
					SLFDATA++;
				break;
				case 0x13f16000://日冻结
				case 0x13f11000:
					FrzDAY++;
				break;
				case 0x13f18000://月冻结
				case 0x13f13000:
					FrzMON++;
				break;
				case 0x13f19000://15分钟冻结
					Frz15Min++;
				break;
				case 0x13f22000://1分钟冻结
					Frz1Min++;
				break;
				case 0x13f12000:
				case 0x13f17000:
					RealMIN++;
					break;
				default:
					NotFrz++;//其他的什么杂七杂八的都删除
				break;
			}
		}
		file++;
	}
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:交采数据=%d \n\n",(u32)&__func__,(u32)__LINE__,SLFDATA);
	myprintf("[%s:%d]:日冻结=%d \n\n",(u32)&__func__,(u32)__LINE__,FrzDAY);
	myprintf("[%s:%d]:月冻结=%d \n\n",(u32)&__func__,(u32)__LINE__,FrzMON);
	myprintf("[%s:%d]:15分钟=%d \n\n",(u32)&__func__,(u32)__LINE__,Frz15Min);
	myprintf("[%s:%d]:1分钟=%d \n\n",(u32)&__func__,(u32)__LINE__,Frz1Min);
	myprintf("[%s:%d]:实时冻结数据=%d \n\n ",(u32)&__func__,(u32)__LINE__,RealMIN);
	myprintf("[%s:%d]:不是江苏需要的数据=%d \n\n ",(u32)&__func__,(u32)__LINE__,NotFrz);
	#endif
}


