gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Record.cpp
#if(USER/100)==15//安徽
u8* GetROAD(u32 ROAD,u8* pDATA)
{
	u32 i;
	u32 x;
	u32 j;
	u32 n;
	u32 Offset;
	
	Offset=29;
	n=pDATA[Offset+1];
	Offset+=2;
	for(i=0;i<n;i++)
	{
		if(pDATA[Offset+1]==0)
		{//OAD
			Offset+=6;
		}
		else
		{//ROAD
			x=pDATA[Offset+6];//关联OAD个数
			j=(pDATA[Offset+2]<<24)+(pDATA[Offset+3]<<16)+(pDATA[Offset+4]<<8)+pDATA[Offset+5];
			if(ROAD==j)
			{
				return pDATA;
			}
			x*=4;
			x+=7;
			Offset+=x;
		}
	}
	return 0;
}
u8* Get_RMOADDATA(u32 OAD,u8* pDATA,bool bInsertData)//得到抄表数据中指定的OAD数据指针,入口:pDATA=抄表数据;返回:0=没找到
{
	u32 i;
	u32 x;
	u32 Offset;
	u32 Len;
	u32 n;
	u32 OADcount;
	u8* pData;
	u32 buff;
	u32 l;


	//计算记录数据开始指针
	Offset=29;
	n=pDATA[Offset+1];
	Offset+=2;
	for(i=0;i<n;i++)
	{
		if(pDATA[Offset+1]==0)
		{//OAD
			Offset+=6;
		}
		else
		{//ROAD
			x=pDATA[Offset+6];//关联OAD个数
			x*=4;
			x+=7;
			Offset+=x;
		}
	}
	pData=pDATA+Offset;	
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)

//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29  采集的CSD  array CSD(有数据类型)
	//找相同OAD在记录中的OAD计数
	Offset=29+2+5;
	OADcount=0;//相同OAD在记录中的OAD计数
	n=pDATA[Offset+1];
	for(i=0;i<n;i++)
	{
		x=(pDATA[Offset+2]<<24)+(pDATA[Offset+3]<<16)+(pDATA[Offset+4]<<8)+pDATA[Offset+5];
		if(OAD==x)
		{
			break;
		}

		OADcount++;
		Offset+=4;
	}
	if(i>=n)
	{//没找到,将OAD添加到pDATA
		if(bInsertData)
		{
			pDATA[29+2+5+1]++;
			OADcount++;

			buff=(u32)ADDR_4KWRITE_BUFF;
			MC(0,buff,1023);

			Offset+=2;
			l=pDATA[6]|(pDATA[7]<<8);
			l-=Offset;
			l+=8;
			MR((u32)buff,(u32)pDATA+Offset,l);
			OAD=R_Inverse(OAD,4);
			MWR(OAD,(u32)pDATA+Offset,4);//添加OAD
			if(l>4096)
			{
				l=4096;
			}
			MR((u32)pDATA+Offset+4,(u32)buff,l);//添加原先的内容
			
			//pDATA[Offset+5+l]=0;//日电压合格率暂定为NULL
			pDATA[6]=(l+4+Offset-8)&0xff;
			pDATA[7]=(l+4+Offset-8)>>8;
		}
		else
			return 0;

	}
	Len=0;//数据偏移
	while(OADcount--)
	{
		Len+=Get_DL698DataLen_S(pData+Len,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
	}
	return pData+Len;
}


void CALC_MeterVoltage_Qualification_Rate(u8 *pbuf)
{
	u32 i;
	u32 iAddrLen;
	u32 iSame;
	u32 iHasUse;
	u32 j;
	u32 a;
	u32 b;
	u32 c;
	u32 f;//当前越限标志
	u32 t;
	u32 x;
	u8 *p8;
	u8 *p8Data;
	u8 *p8Addr;
	u32 limitH;//电压考核上限
	u32 limitL;//电压考核下限
	u32 standardH;//电压合格上限
	u32 standardL;//电压合格下限

	t=Comm_Ram->DL698YMDHMS[3];//日
	t--;
	MR(ADDR_DATABUFF,ADDR_4030,LENmax_4030);
	p8=(u8*)ADDR_DATABUFF;
	limitH=(p8[3]<<8)|p8[4];//电压考核上限
	limitL=(p8[6]<<8)|p8[7];//电压考核下限
	standardH=(p8[9]<<8)|p8[10];//电压合格上限
	standardL=(p8[12]<<8)|p8[13];//电压合格下限
	
	
	
	for(i=0;i<3;i++)
	{
//初始化数据结构
		p8=(u8*)ADDR_2131_OneDay+(LENmax_2131_OneDay*i);
		MR(ADDR_DATABUFF,(u32)pbuf,6);//获取电表通信地址;
		p8Addr=(u8*)ADDR_DATABUFF;
		iSame=0;
		for(j=0;j<NUM_RMmax;j++)
		{
			for(iAddrLen=0;iAddrLen<6;iAddrLen++)
			{
				if(p8Addr[iAddrLen]!=p8[6+iAddrLen+j*48])
				{
					iSame=0;
					break;
				}
				iSame=1;
			}
			if(iSame==1)
				break;
		}
		if(iSame==0)
		{
			for(j=0;j<NUM_RMmax;j++)
			{
				iHasUse=0;
				for(iAddrLen=0;iAddrLen<6;iAddrLen++)
				{
					if(p8[6+iAddrLen+j*48]==0)
					{
						iHasUse++;
					}
				}
				if(iHasUse==6)
						break;
			}
			p8=(u8*)ADDR_2131_OneDay+(i*LENmax_2131_OneDay)+(j*48);
			MR((u32)p8+6,(u32)p8Addr,6);
		}
		else
		{
			if(p8[39]==0)
			{
				MC(0,ADDR_2131_OneDay+(i*LENmax_2131_OneDay)+(j*48),48);
				p8[39]=t;
			}
			else if(p8[39]!=t)
			{
				x=p8[39];
				MW(ADDR_2131_OneDay+(i*LENmax_2131_OneDay)+(j*48),ADDR_2131_All+(((i*31)+x)*LENmax_2131_All)+(j*48),48);
				MC(0,ADDR_2131_OneDay+12+(i*LENmax_2131_OneDay)+(j*48),36);
				p8[39]=t;
			}
		}
		p8[5]=5;//通信地址长度
			
//属性2（电压合格率数据）∷=structure
		p8[0]=DataType_structure;
		p8[1]=2;
//{
//  当日电压合格率         电压合格率，
//电压合格率∷=structure
		p8[2]=DataType_structure;
		p8[3]=7;
//{
// 存储采集到数据的电表通信地址  octet-string
		p8[4]=DataType_octet_string;
		p8[5]=6;
// 电压监测时间  double-long-unsigned（单位：分钟，无换算），
		p8[12]=DataType_double_long_unsigned;
//电压合格率   long-unsigned（单位：%，换算：-2），
		p8[17]=DataType_long_unsigned;
//电压超限率   long-unsigned（单位：%，换算：-2），
		p8[20]=DataType_long_unsigned;
//电压超上限时间  double-long-unsigned（单位：分钟，无换算），
		p8[23]=DataType_double_long_unsigned;
//电压超下限时间  double-long-unsigned（单位：分钟，无换算）
		p8[28]=DataType_double_long_unsigned;
		// 上次电压监测时间  double-long-unsigned（单位：分钟，无换算），
		p8[33]=DataType_double_long_unsigned;
//}
//  当月电压合格率         电压合格率
//电压合格率∷=structure
		p8[38]=0;//当月电压合格率为空
		
		MR(ADDR_DATABUFF,(u32)pbuf+29+11+3*i,2);//获取对应电压数据
		p8Data = (u8*)ADDR_DATABUFF;//取任务读取的电压
		a=(p8Data[0]<<8)|p8Data[1];
		if(a>=limitH)//电压考核上限
		{
			f=1;//电压当前越限标志:0=空,1=越考核上限,2=越合格上限,3=合格,4=越合格下限,5=越考核下限
		}
		else
		{
			if(a>=standardH)//电压合格上限
			{
				f=2;//电压当前越限标志:0=空,1=越考核上限,2=越合格上限,3=合格,4=越合格下限,5=越考核下限
			}
			else
			{
				if(a<=limitL)//电压考核下限
				{
					f=5;//电压当前越限标志:0=空,1=越考核上限,2=越合格上限,3=合格,4=越合格下限,5=越考核下限
				}
				else
				{
					if(a<=standardL)//电压合格下限
					{
						f=4;//电压当前越限标志:0=空,1=越考核上限,2=越合格上限,3=合格,4=越合格下限,5=越考核下限
					}
					else
					{
						f=3;//电压当前越限标志:0=空,1=越考核上限,2=越合格上限,3=合格,4=越合格下限,5=越考核下限
					}
				}
			}
		}
		a=Comm_Ram->DL698YMDHMS[4];//时
		a*=60;
		a+=Comm_Ram->DL698YMDHMS[5];//分
		//当日电压监测时间
		
		MR(ADDR_DATABUFF,(u32)ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48,48);//获取对应电压数据
		//p8t=(u8*)ADDR_DATABUFF;
		//b=R_Inverse(a,4);
		MR((u32)p8Data,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+34,4);
		b=(p8Data[0]<<24)|(p8Data[1]<<16)|(p8Data[2]<<8)|(p8Data[3]);
		if(b==0)//表示日电压合格率计算结果清空后
		{
			b=1;
		}
		else	
		{
//			if(a<b)
//			{
//				c=0;
//				c=R_Inverse(c,4);
//				MWR(c,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+3+8,4);//电压监测时间清零
//				MWR(c,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+14+8,4);//电压超上限时间清零
//				MWR(c,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+19+8,4);//电压超下限时间清零
//				MWR(c,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+8+8,2);//电压合格率清零
//				MWR(c,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+11+8,2);//电压超限率清零
//				b=1;
//			}
//			else
			if(a>=b)
			{
				x=a-b;
				if(x<=5)//五分钟以内的差距，默认为中间的数据是丢了，超过五分钟，表示调节了系统时间
					b=x;
				else
					b=1;
			}
			else
				b=1;
		}
		a=R_Inverse(a,4);
		MWR(a,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+34,4);
		
		c=MRR(ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+3+8,4);//电压监测时间
		c=R_Inverse(c,4);
		c+=b;
		c=R_Inverse(c,4);
		MWR(c,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+3+8,4);
		switch(f)
		{
			case 1://1=越考核上限
			case 2://2=越合格上限,
				//当日电压超上限时间
				c=MRR(ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+14+8,4);
				c=R_Inverse(c,4);
				c+=b;
				c=R_Inverse(c,4);
				MWR(c,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+14+8,4);
				break;
			case 3://3=合格
				break;
			case 4://4=越合格下限,
			case 5://5=越考核下限
				//当日电压超下限时间
				c=MRR(ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+19+8,4);
				c=R_Inverse(c,4);
				c+=b;
				c=R_Inverse(c,4);
				MWR(c,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+19+8,4);
				break;
		}
		//当日电压超限率
		//a=MRR(ADDR_2131_1+((i*31+t)*LENmax_2131_1+j*48)+2+3+8,4);//电压监测时间
		b=MRR(ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+14+8,4);//电压超上限时间
		c=MRR(ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+19+8,4);//电压超下限时间
		a=1440;
		b=R_Inverse(b,4);
		c=R_Inverse(c,4);
		b+=c;
		if(b>a)
		{
			b=a;
		}
		b*=10000;//%二位小数
		c=b/a;//超限率
		b=10000-c;//合格率
		b=R_Inverse(b,2);
		c=R_Inverse(c,2);
		MWR(b,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+8+8,2);//电压合格率
		MWR(c,ADDR_2131_OneDay+i*LENmax_2131_OneDay+j*48+2+11+8,2);//电压超限率
		
		
