gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Record.cpp
	}
}
void Addr_Voltage_Qualification_Rate(u8 *pbuf)
{
	u32 a;
	u32 i;
	u32 j;
	u32 day;
	u32 iAddrLen;
	u32 iSame;
	u8* p8;
	u32 len;
	u8* p8Data;
	u8* pDATA;
	for(i=0;i<3;i++)
	{
		MR(ADDR_DATABUFF,(u32)pbuf,6);//获取电表通信地址;
		MR(ADDR_DATABUFF+6,(u32)pbuf+22,7);//存储时标，保存日冻结当天最后一分钟的时间即23:59;
		p8=(u8*)ADDR_DATABUFF;
		day=p8[6+3];//表示具体哪一天的冻结
		day--;
		p8Data=(u8*)ADDR_4KWRITE_BUFF;
		MR((u32)p8Data,ADDR_2131_All+(((i*31)+day)*LENmax_2131_All),LENmax_2131_All);
//		if(p8Data[0]==0xff)
//		{
//			MC(0,(u32)p8Data,LENmax_2131_All);
//		}
		iSame=0;
		for(j=0;j<NUM_RMmax;j++)
		{
			for(iAddrLen=0;iAddrLen<6;iAddrLen++)
			{
				if(p8[iAddrLen]!=p8Data[6+iAddrLen+j*48])
				{
					iSame=0;
					break;
				}
				iSame=1;
			}
			if(iSame==1)
				break;
		}
		MR((u32)p8,(u32)p8Data+12+j*48,21);
		if(i==0)
			pDATA=Get_RMOADDATA(0x21310201,pbuf,true);
		if(i==1)
			pDATA=Get_RMOADDATA(0x21320201,pbuf,true);
		if(i==2)
			pDATA=Get_RMOADDATA(0x21330201,pbuf,true);
		
		if(iSame==0||p8[0]==0)//电压合格率未产生记录,将当天的数据记录为全部合格
		{
			p8[0]=DataType_structure;
			p8[1]=2;
		//{
		//  当日电压合格率         电压合格率，
		//电压合格率∷=structure
			p8[2]=DataType_structure;
			p8[3]=5;

		// 电压监测时间  double-long-unsigned（单位：分钟，无换算），
			p8[4]=DataType_double_long_unsigned;
			a=0;
			a=R_Inverse(a,4);
			MWR(a,(u32)p8+5,4);
			
		//电压合格率   long-unsigned（单位：%，换算：-2），
			p8[9]=DataType_long_unsigned;
			a=10000;
			a=R_Inverse(a,2);
			MWR(a,(u32)p8+10,2);
		//电压超限率   long-unsigned（单位：%，换算：-2），
			p8[12]=DataType_long_unsigned;
			a=0;
			a=R_Inverse(a,2);
			MWR(a,(u32)p8+13,2);
		//电压超上限时间  double-long-unsigned（单位：分钟，无换算），
			p8[15]=DataType_double_long_unsigned;
			a=0;
			a=R_Inverse(a,4);
			MWR(a,(u32)p8+16,4);
		//电压超下限时间  double-long-unsigned（单位：分钟，无换算）
			p8[20]=DataType_double_long_unsigned;
			a=0;
			a=R_Inverse(a,4);
			MWR(a,(u32)p8+21,4);
			p8[25]=0;//当月电压合格率为空
			
			MW((u32)p8+2,(u32)pDATA,23);
		}
		else
		{
			pDATA[0]=2;
			pDATA[1]=5;
			
			MW((u32)p8,(u32)pDATA+2,21);
		}

		len=pbuf[6]|(pbuf[7]<<8);
		len+=23;
		pbuf[6]=(len>>0)&0xff;
		pbuf[7]=(len>>8)&0xff;

	}
}
#endif



#if(USER/100)==17//???
u32 InsertRecord(u32 PORTn,u32 FileID,u8* pbuf,u32 len)
{
	u32 filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	u32 n;
	RecordFileHead_TypeDef* RecordFileHead;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	u32 i;
	u32 offset;
	u8 *p8;
	u32 lenAddr;
	u32 m;
	
	ms=Get_ms();
	filename=Get_RecordFileName(FileID,0xffffffff,pbuf+22);
	if(filename==0xffffffff)//???????????????
		return 0;
	if(filename<FILENAMEmax_FLASH)
	{
		file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
	}
	else
	{
		file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
	}
	
	lenAddr=6;
	n=file->NUM_DATA;
	ms->msfile_read(filename,0,(u8*)ADDR_AddrList,n*sizeof(RecordFileHead_TypeDef));
	RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_AddrList);
	offset=0;
	Addr0=pbuf[0]|(pbuf[1]<<8);
	Addr1=pbuf[2]|(pbuf[3]<<8);
	Addr2=pbuf[4]|(pbuf[5]<<8);
	for(i=0;i<n;i++)
	{
		if(RecordFileHead->Addr0==Addr0)
		{
			if(RecordFileHead->Addr1==Addr1)
			{
				if(RecordFileHead->Addr2==Addr2)
				{
					break;
				}
			}
		}
		offset+=RecordFileHead->LEN_DATA;
		RecordFileHead++;
	}
	if(i>=n)
	{//???
		return 0;
	}
	i=RecordFileHead->LEN_DATA;
	ms->msfile_read(filename,(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+offset,(u8*)ADDR_4KWRITE_BUFF,i);
	
	p8=(u8*)ADDR_4KWRITE_BUFF;
	m=p8[29];
	n=37+1+4*pbuf[31+lenAddr];
	pbuf[31+lenAddr]+=(m-1);
	MW((u32)pbuf+n,(u32)pbuf+1024,len-n);
	m=(p8[29]-1)*4;
	MW((u32)p8+34,(u32)pbuf+n,m);
	MW((u32)pbuf+1024,(u32)pbuf+n+m,len-n);
	MW((u32)p8+34+m+4,(u32)pbuf+len+m,i-38-m);
//	p8+=(pbuf[31+lenAddr]-1)*4;
//	MW(ADDR_4KWRITE_BUFF,(u32)p8,n);
//	p8+=n;
//	n=pbuf[31+lenAddr];
//	MW((u32)pbuf+31+n*4+lenAddr,(u32)p8,len-31-n*4);
//	
//	n=RecordFileHead->LEN_DATA-i*4-31;
//	
//	MW(ADDR_DATABUFF,(u32)pbuf+lenAddr+2,len+(i-1)*4+n);
	
	pbuf[lenAddr]=(len+i-30)&0xff;
	pbuf[lenAddr+1]=(len+i-30)>>8;
	
	return len+i-30;
	
//	y=file->NUM_DATA;//??????????(???????)
//	if(y>NUM_RMmax)
//	{
//		y=NUM_RMmax;
//	}
//	ms->msfile_read(filename,0,(u8*)ADDR_AddrList,y*sizeof(RecordFileHead_TypeDef));
//	RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_AddrList);
//	Addr0=pbuf[0]|(pbuf[1]<<8);
//	Addr1=pbuf[2]|(pbuf[3]<<8);
//	Addr2=pbuf[4]|(pbuf[5]<<8);
//	for(i=0;i<y;i++)
//	{
//		if(RecordFileHead->Addr0==Addr0)
//		{
//			if(RecordFileHead->Addr1==Addr1)
//			{
//				if(RecordFileHead->Addr2==Addr2)
//				{
//					break;
//				}
//			}
//		}
//		RecordFileHead++;
//	}
	
}
#endif
void ReSave_ACSAMPLE_Data(u32 PORTn,u8 *pbuf,u32 FileID)
{
	u32 i;
	u32 x;
	u32 y;
	u32 filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	RecordFileHead_TypeDef* RecordFileHead;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	//u8* p8;
	UARTCtrl_TypeDef *UARTCtrl;
	
	ms=Get_ms();
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	i=UARTCtrl->TaskID;
	i>>=8;
	i&=0xff;//任务号

	if(PORTn!=ACSAMPLEPORT)
	{
		return ;
	}
	Comm_Ram->msFILESearchCount=0;

	if((FileID&0x0f)==1)//不是15分钟交采数据
	{
		FileID=0x13f12000;//1分钟打包的那个文件  15分钟数据	
		filename=Get_RecordFileName_JS(FileID,0xffffffff,pbuf+8);//虘谭蟿菥幕:色酄?FileID=b31-b28捉懈`褝,b27-b24訅墀`褝,b23-b20咋寓时要`褝,b19-b12蓭媳蹍,b11-b8讒酄氎?b7-b0,袪应圆值为0xF噎示一跇注,pTime私邼咋寓时要=0噎示一跇注;SearchCount=擢始虘谭謩蟿菥蹍0xFFFFFFFF噎示論蕪諑蕖烁蹍擢始虘谭;椎軜:0--(FILENAMEmax_FLASH-1)噎示蟿菥諝FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)噎示蟿菥諝RAM,0xffffffff噎示没謷战
	}else
	{
		filename=Get_RecordFileName_JS(FileID,0xffffffff,pbuf+22);//虘谭蟿菥幕:色酄?FileID=b31-b28捉懈`褝,b27-b24訅墀`褝,b23-b20咋寓时要`褝,b19-b12蓭媳蹍,b11-b8讒酄氎?b7-b0,袪应圆值为0xF噎示一跇注,pTime私邼咋寓时要=0噎示一跇注;SearchCount=擢始虘谭謩蟿菥蹍0xFFFFFFFF噎示論蕪諑蕖烁蹍擢始虘谭;椎軜:0--(FILENAMEmax_FLASH-1)噎示蟿菥諝FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)噎示蟿菥諝RAM,0xffffffff噎示没謷战
	}
	if(filename!=0xffffffff)
	{
		if(filename<FILENAMEmax_FLASH)
		{
			file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
		}
		else
		{
			file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
		}
		y=file->NUM_DATA;//文件存入数据个数计数(同抄表成功个数)
		if(y>NUM_RMmax)
		{
			y=NUM_RMmax;
		}
		ms->msfile_read(filename,0,(u8*)ADDR_AddrList,y*sizeof(RecordFileHead_TypeDef));
		RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_AddrList);
		Addr0=pbuf[0]|(pbuf[1]<<8);
		Addr1=pbuf[2]|(pbuf[3]<<8);
		Addr2=pbuf[4]|(pbuf[5]<<8);
		for(i=0;i<y;i++)
		{
			if(RecordFileHead->Addr0==Addr0)
			{
				if(RecordFileHead->Addr1==Addr1)
				{
					if(RecordFileHead->Addr2==Addr2)
					{
						break;
					}
				}
			}
			RecordFileHead++;
		}
		if(i<y)
		{//地址已存在
			if((FileID==0x13f12000)||(FileID==0x13f17000))
			{
				;
			}else
			{
				return;//补抄曲线等数据时可能会重复,故不能删除文件
			}
		}
	}
	if(filename==0xffffffff)
	{//没找到
		while(1)
		{
			file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
			for(filename=0;filename<recordFILENAMEmax_FLASH;filename++)
			{
				if(file->BLOCK_ENTRY==0)
				{
					break;
				}
				file++;
			}
			if(filename>=recordFILENAMEmax_FLASH)
			{//没空
				i=AutoDeleteFile(0);//自动删除记录文件(自动减少存储深度);入口:写入文件时空间不够的文件名,以判别是RAM还是FLASH空间不够;返回:0=没删除,1=有删除
				if(i)
				{//有删除
					continue;
				}
				return;
			}
			break;
		}
	}
	if(file->BLOCK_ENTRY==0)
	{//空文件
		ms->msfile_lenclear(filename);//清0文件相关的长度次数,0-(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH-(FILENAMEmax_RAM-1)表示文件在RAM
		file->FILEID=FileID;
		file->FILECOUNT=0;
		file->LEN_DATA=0;
		file->NUM_DATA=0;
		if((FileID==0x13f12000)||(FileID==0x13f17000))
		{
			MW((u32)pbuf+8,(u32)&file->save_date_time_s,7);//采集存储时标
			MW((u32)pbuf+15,(u32)&file->start_date_time_s,7);//采集启动时间
		}else
		{
			MW((u32)pbuf+22,(u32)&file->save_date_time_s,7);//采集存储时标
			MW((u32)pbuf+8,(u32)&file->start_date_time_s,7);//采集启动时间
		}
	}
//写文件
	x=file->NUM_DATA;
	if(x>=NUM_RMmax)
	{//错
		ms->msfile_Delete(filename);
		return;
	}
	//写数据
	if(filename>=FILENAMEmax_FLASH)
	{//RAM中文件
		i=ms->ms_malloc_sizemax();//最大可分配的尺寸(字节数)
		if(i<(1024*1024))
		{//空间<1M,保留至少1M空间用于记录数据读取
			y=AutoDeleteFile(filename);//自动删除记录文件(自动减少存储深度);入口:写入文件时空间不够的文件名,以判别是RAM还是FLASH空间不够;返回:0=没删除,1=有删除
			if(y==0)
			{//没删除
				return;
			}
		}
	}
	i=file->LEN_DATA;
	if(i==0)
	{
		i=(NUM_RMmax*sizeof(RecordFileHead_TypeDef));
	}
	RecordFileHead=(RecordFileHead_TypeDef*)pbuf;
	while(1)
	{
		y=RecordFileHead->LEN_DATA;
		y=ms->msfile_write(filename,i,pbuf+sizeof(RecordFileHead_TypeDef),y);
		if(y!=RecordFileHead->LEN_DATA)
		{//写错误
			y=AutoDeleteFile(filename);//自动删除记录文件(自动减少存储深度);入口:写入文件时空间不够的文件名,以判别是RAM还是FLASH空间不够;返回:0=没删除,1=有删除
			if(y)
			{//有删除
				continue;
			}
			return;
		}
		break;
	}
	i+=y;
	file->LEN_DATA=i;
	
	//写地址列表
	ms->msfile_write(filename,x*sizeof(RecordFileHead_TypeDef),pbuf,sizeof(RecordFileHead_TypeDef));
	//数据数+1
	x++;
	file->NUM_DATA=x;
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:写入成功 \n",(u32)&__func__,(u32)__LINE__,0);
	#endif
}

//UART抄表数据缓冲定义
//#define LEN_RM_DI_CSD     512
//抄表数据缓冲1,最大总长度=LEN_RM_DI_CSD
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)

//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29  采集的CSD  array CSD(有数据类型)

