gdgly/NUC97X_JS/STM32F4xx/DL698/RM_Record.cpp
//抄表数据缓冲2,最大总长度=LEN_UARTnFnDataBuff-LEN_RM_DI_CSD
//LEN_RM_DI_CSD   2byte 长度=已填写入buff但还没完整一个CSD的长度(不包括本身2字节)
//LEN_RM_DI_CSD+2 2byte 长度=已填写入buff完整CSD的长度(不包括本身2字节)
//LEN_RM_DI_CSD+4 采集的数据(有数据类型)


//抄表结束后合并在数据缓冲1
//0 6byte 电能表地址
//6 2byte 长度=时标+已采集的CSD(不包括本身2字节)
//8 7byte 采集启动时标  date_time_s(无数据类型)
//15 7byte 采集成功时标  date_time_s(无数据类型)
//22 7byte 采集存储时标  date_time_s(无数据类型)
//29 采集的CSD  array CSD(有数据类型)
//n  采集的数据(有数据类型,全部数据为单独顺序排列无总数组)
void RM_RecordFile(u32 PORTn,u8 *pbuf)//抄表数据处理(存贮,事件)
{
	u32 i;
	u32 x;
	u32 y;
	u32 FileID;
	u32 EventID;//事件关联的ID
	u32 filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	RecordFileHead_TypeDef* RecordFileHead;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	u8* p8;
	UARTCtrl_TypeDef *UARTCtrl;
	#if (USER/100)==15//安徽
	u8* pDATA;
	#endif
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	//i=UARTCtrl->TaskID;
	//i>>=8;
	//i&=0xff;//任务号
#if(USER/100)==17//江苏系
	if((((UARTCtrl->TaskID>>20)&0xf)==5)&&(Terminal_Router->MinuteCollect==1))
	{
		switch(UARTCtrl->res23)
		{
			case 3:
			case 4:
				UARTCtrl->TaskID|=0x0000ff00;
				UARTCtrl->TaskID&=0xffff22ff;
				break;
			case 1:
			case 6:
				UARTCtrl->TaskID|=0x0000ff00;
				UARTCtrl->TaskID&=0xffff16ff;
				break;
			case 2:
			case 7:
				UARTCtrl->TaskID|=0x0000ff00;
				UARTCtrl->TaskID&=0xffff18ff;
				break;
			case 8:
			case 9:
				UARTCtrl->TaskID|=0x0000ff00;
				UARTCtrl->TaskID&=0xffff19ff;
				break;
			case 10:
				UARTCtrl->TaskID|=0x0000ff00;
				UARTCtrl->TaskID&=0xffff11ff;
				break;
			case 11:
				UARTCtrl->TaskID|=0x0000ff00;
				UARTCtrl->TaskID&=0xffff13ff;
				break;
			case 12:
				UARTCtrl->TaskID|=0x0000ff00;
				UARTCtrl->TaskID&=0xffff12ff;//一分钟
				break;
			case 13:
				UARTCtrl->TaskID|=0x0000ff00;
				UARTCtrl->TaskID&=0xffff17ff;//15分钟
			default:
				break;	
		}	
	}
	
	if((PORTn==ACSAMPLEPORT)&&(Terminal_Router->MinuteCollect==1))
	//if((PORTn==ACSAMPLEPORT))//交采
	{
		x=21;
		x+=8;
		x+=4;
		#ifdef DEBUG_JSON	
		myprintf("[%s:%d]:交采接受\n",(u32)__func__,(u32)__LINE__,0);
		for(i=0;i<300;i++)
		{	
			myprintf("%02x ",pbuf[i],0,0);
		}
		myprintf("\n",0,0,0);
		#endif
		i=(pbuf[x]<<24)|(pbuf[x+1]<<16)|(pbuf[x+2]<<8)|pbuf[x+3];
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:交采记录性OAD=%08x\n",(u32)&__func__,(u32)__LINE__,i);
		#endif
		switch(i)
		{
			case 0x50040200:
				FileID=0x13f16000;
				break;
			case 0x50060200:
				FileID=0x13f18000;
				break;
			case 0x50020200:
				FileID=0x13f19000;//15分钟数据
				break;
			default:
				return;
		}
		ReSave_ACSAMPLE_Data(PORTn,pbuf,FileID);
		if(FileID==0x13f19000)
		{
			FileID|=1;
			ReSave_ACSAMPLE_Data(PORTn,pbuf,FileID);
		}
		return;//如果是支持分钟采集,直接退出
	}
	
#endif
	i=UARTCtrl->TaskID;
	i>>=8;
	i&=0xff;//任务号

	switch(i)
	{
		case RMTASKnoPOWER://停上电事件固定任务号
			#if (USER/100)==15//安徽
			if(UARTCtrl->RMprotocol==3)
				//PowerEventTimerComp(pbuf+37);
				PowerEventTimerComp(pbuf+56);
			if(UARTCtrl->RMprotocol==2)
				PowerEventTimerComp(pbuf+58);
			#else
			PowerEventTimerComp(pbuf+37);//停上电事件时间比较,入口:pEVENT指向698格式事件的开始,出口:PowerEvent->bit
			#endif
			return;
		#if (USER/100)==15//安徽
		case 49://日电压合格率采集方案
			if(UARTCtrl->RMprotocol==2)
				CALC_MeterVoltage_Qualification_Rate(pbuf);
			return;
		case 1://日冻结采集数据项
			pDATA=GetROAD(0x50040200,pbuf);
			if(pDATA!=0&&UARTCtrl->RMprotocol==2)
			{
				MR(ADDR_DATABUFF,(u32)pbuf+15,7);//成功时标
				p8=(u8*)ADDR_DATABUFF;
				pDATA=Get_RMOADDATA(0x20210200,pbuf,false);
				x=Compare_DL698DataString(pDATA+1,p8,4);//电表的数据冻结时间和采集成功时间的日期不符，不保存电表的数据
				if(x!=0)
					return;
				Addr_Voltage_Qualification_Rate(pbuf);
			}
			else
			{
				EventID=Event_RMDATA(PORTn,pbuf+sizeof(RecordFileHead_TypeDef));//抄表数据相关的事件
				EventID=EventID;
				Update_Group_Total_Data_6000(pbuf);//更新总加组的数据,配置表是6000里的
			}
			break;
		case 5://单相表日冻结采集数据项
			pDATA=GetROAD(0x50040200,pbuf);
			if(pDATA!=0&&UARTCtrl->RMprotocol==2)
			{
				MR(ADDR_DATABUFF,(u32)pbuf+15,7);//成功时标
				p8=(u8*)ADDR_DATABUFF;
				pDATA=Get_RMOADDATA(0x20210200,pbuf,false);
				x=Compare_DL698DataString(pDATA+1,p8,4);//电表的数据冻结时间和采集成功时间的日期不符，不保存电表的数据
				if(x!=0)
					return;
			}
			EventID=Event_RMDATA(PORTn,pbuf+sizeof(RecordFileHead_TypeDef));//抄表数据相关的事件
			EventID=EventID;
			Update_Group_Total_Data_6000(pbuf);//更新总加组的数据,配置表是6000里的
		#endif
		default:
		#if(USER/100)==17//江苏系
			if((((UARTCtrl->TaskID>>20)&0xf)==5)&&(Terminal_Router->MinuteCollect==1))
				break;
		#endif
			EventID=Event_RMDATA(PORTn,pbuf+sizeof(RecordFileHead_TypeDef));//抄表数据相关的事件
			EventID=EventID;
			Update_Group_Total_Data_6000(pbuf);//更新总加组的数据,配置表是6000里的
			break;
	}

//TaskID=b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
//优先级:1=首要,2=必要,3=需要,4=可能
//方案类型:1=普通采集方案,2=事件采集方案,3=透明方案,4=上报方案,5=脚本方案
//普通采集方案的采集类型:0=采集当前数据,1=采集上第N次,2=按冻结时标采集,3=按时标间隔采集,4=补抄
//普通采集方案的存储时标:0=未定义,1=任务开始时间,2=相对当日0点0分,3=相对上日23点59分,4=相对上日0点0分,5=相对当月1日0点0分,6=数据冻结时标
	Comm_Ram->msFILEchange=0;//文件管理数据变化:0=变化,!=没变化
	ms=Get_ms();
	//UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	FileID=Get_FileID(PORTn);//UART各任务的FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类
	Comm_Ram->msFILESearchCount=0;

	if(Terminal_Router->MinuteCollect==1)
	{
		if((FileID==0x13f12000)||(FileID==0x13f17000))
		{	
			filename=Get_RecordFileName_JS(FileID,0xffffffff,pbuf+8);//虘谭蟿菥幕:色酄?FileID=b31-b28捉懈`褝,b27-b24訅墀`褝,b23-b20咋寓时要`褝,b19-b12蓭媳蹍,b11-b8讒酄氎?b7-b0,袪应圆值为0xF噎示一跇注,pTime私邼咋寓时要=0噎示一跇注;SearchCount=擢始虘谭謩蟿菥蹍0xFFFFFFFF噎示論蕪諑蕖烁蹍擢始虘谭;椎軜:0--(FILENAMEmax_FLASH-1)噎示蟿菥諝FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)噎示蟿菥諝RAM,0xffffffff噎示没謷战
		}
		else
		{
			filename=Get_RecordFileName_JS(FileID,0xffffffff,pbuf+22);//虘谭蟿菥幕:色酄?FileID=b31-b28捉懈`褝,b27-b24訅墀`褝,b23-b20咋寓时要`褝,b19-b12蓭媳蹍,b11-b8讒酄氎?b7-b0,袪应圆值为0xF噎示一跇注,pTime私邼咋寓时要=0噎示一跇注;SearchCount=擢始虘谭謩蟿菥蹍0xFFFFFFFF噎示論蕪諑蕖烁蹍擢始虘谭;椎軜:0--(FILENAMEmax_FLASH-1)噎示蟿菥諝FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)噎示蟿菥諝RAM,0xffffffff噎示没謷战
		}
	}
	else
	{
		filename=Get_RecordFileName(FileID,0xffffffff,pbuf+22);//虘谭蟿菥幕:色酄?FileID=b31-b28捉懈`褝,b27-b24訅墀`褝,b23-b20咋寓时要`褝,b19-b12蓭媳蹍,b11-b8讒酄氎?b7-b0,袪应圆值为0xF噎示一跇注,pTime私邼咋寓时要=0噎示一跇注;SearchCount=擢始虘谭謩蟿菥蹍0xFFFFFFFF噎示論蕪諑蕖烁蹍擢始虘谭;椎軜:0--(FILENAMEmax_FLASH-1)噎示蟿菥諝FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)噎示蟿菥諝RAM,0xffffffff噎示没謷战
	}
	
	if(filename!=0xffffffff)
	{
		if(filename<FILENAMEmax_FLASH)
		{
			file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
		}
		else
		{
			file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
		}
		y=file->NUM_DATA;//文件存入数据个数计数(同抄表成功个数)
		if(y>NUM_RMmax)
		{
			y=NUM_RMmax;
		}
		ms->msfile_read(filename,0,(u8*)ADDR_AddrList,y*sizeof(RecordFileHead_TypeDef));
		RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_AddrList);
		Addr0=pbuf[0]|(pbuf[1]<<8);
		Addr1=pbuf[2]|(pbuf[3]<<8);
		Addr2=pbuf[4]|(pbuf[5]<<8);
		for(i=0;i<y;i++)
		{
			if(RecordFileHead->Addr0==Addr0)
			{
				if(RecordFileHead->Addr1==Addr1)
				{
					if(RecordFileHead->Addr2==Addr2)
					{
						break;
					}
				}
			}
			RecordFileHead++;
		}
		if(i<y)
		{//地址已存在
			if((FileID==0x13f12000)||(FileID==0x13f17000))
			{
				;
			}else
			{
				return;//补抄曲线等数据时可能会重复,故不能删除文件
			}
		}
	}
	if(filename==0xffffffff)
	{//没找到
	#if(USER/100)==17//江苏系
		switch(UARTCtrl->res23)
		{
			case 1:
			case 6:
			case 2:
			case 7:
			case 10:
			case 11:
			case 12:
			case 13:
			case 3:
			case 4:
			case 8:
			case 9:
				break;
			default:
				//CountInc_RecordFile(PORTn);//当有文件计数=0时,全部记录文件文件计数+1,删除达到记录深度的文件
				//AutoDelete_ErrID_RecordFile();//自动删除任务已不存在的记录文件;返回:0=没删除,1=有删除
				break;
		}
	#else
		CountInc_RecordFile(PORTn);//当有文件计数=0时,全部记录文件文件计数+1,删除达到记录深度的文件
		AutoDelete_ErrID_RecordFile();//自动删除任务已不存在的记录文件;返回:0=没删除,1=有删除
	#endif
		//找空文件
#if RecordFILEallinFLASH==0//全部普通抄表方案数据保存在nand flash:0=否(只抄OAD时存在RAM),1=是
	#if (USER/100)==0//电科院测试
		i=UARTCtrl->RMOADROAD;//抄表任务有抄过的OAD类型:b0=有OAD,b1=有ROAD,b3-b7保留;用于抄表数据存贮时是存在RAM还是NAND
		if(i==1)//全部只抄OAD,RAM文件
	#else
		//FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类
		if(((FileID>>24)&0xff)==0x10)//1=普通采集方案,采集类型=0=采集当前数据
	#endif
		{
			//myprintf("[%s:%d]:删除((FileID>>24)&0xff)==0x10\n",(u32)&__func__,(u32)__LINE__,0);
			while(1)
			{
				file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage);
				for(filename=0;filename<recordFILENAMEmax_RAM;filename++)
				{
					if(file->BLOCK_ENTRY==0)
					{
						break;
					}
					file++;
				}
				if(filename>=recordFILENAMEmax_RAM)
				{//没空
					i=AutoDeleteFile(FILENAMEmax_FLASH);//自动删除记录文件(自动减少存储深度);入口:写入文件时空间不够的文件名,以判别是RAM还是FLASH空间不够;返回:0=没删除,1=有删除
					if(i)
					{//有删除
						continue;
					}
					return;
				}
				break;
			}
			filename+=FILENAMEmax_FLASH;
		}
		else
#endif
		{//FLASH文件	
			while(1)
			{
				file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
				for(filename=0;filename<recordFILENAMEmax_FLASH;filename++)
				{
					if(file->BLOCK_ENTRY==0)
					{
						break;
					}
					file++;
				}
				if(filename>=recordFILENAMEmax_FLASH)
				{//没空
					i=AutoDeleteFile(0);//自动删除记录文件(自动减少存储深度);入口:写入文件时空间不够的文件名,以判别是RAM还是FLASH空间不够;返回:0=没删除,1=有删除
					if(i)
					{//有删除
						continue;
					}
					return;
				}
				break;
			}
		}
	}
	if(file->BLOCK_ENTRY==0)
	{//空文件
		ms->msfile_lenclear(filename);//清0文件相关的长度次数,0-(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH-(FILENAMEmax_RAM-1)表示文件在RAM
		file->FILEID=FileID;
		file->FILECOUNT=0;
		if(Terminal_Router->MinuteCollect==1)
		{
			file->LEN_DATA=0;
			file->NUM_DATA=0;
			if((FileID==0x13f12000)||(FileID==0x13f17000))
			{
				MW((u32)pbuf+8,(u32)&file->save_date_time_s,7);//采集存储时标
				MW((u32)pbuf+15,(u32)&file->start_date_time_s,7);//采集启动时间
			}else
			{
				MW((u32)pbuf+22,(u32)&file->save_date_time_s,7);//采集存储时标
				MW((u32)pbuf+8,(u32)&file->start_date_time_s,7);//采集启动时间
			}
		}
		else
		{
			MW((u32)pbuf+22,(u32)&file->save_date_time_s,7);//采集存储时标
			MW((u32)pbuf+8,(u32)&file->start_date_time_s,7);//采集启动时间
		}
	}
//写文件
	x=file->NUM_DATA;
	if(x>=NUM_RMmax)
	{//错
		ms->msfile_Delete(filename);
		return;
	}
	//写数据
	if(filename>=FILENAMEmax_FLASH)
	{//RAM中文件
		i=ms->ms_malloc_sizemax();//最大可分配的尺寸(字节数)
		if(i<(1024*1024))
		{//空间<1M,保留至少1M空间用于记录数据读取
			y=AutoDeleteFile(filename);//自动删除记录文件(自动减少存储深度);入口:写入文件时空间不够的文件名,以判别是RAM还是FLASH空间不够;返回:0=没删除,1=有删除
			if(y==0)
			{//没删除
				return;
			}
		}
	}
	i=file->LEN_DATA;
	if(i==0)
	{
		i=(NUM_RMmax*sizeof(RecordFileHead_TypeDef));
	}
	RecordFileHead=(RecordFileHead_TypeDef*)pbuf;
	while(1)
	{
		y=RecordFileHead->LEN_DATA;
		y=ms->msfile_write(filename,i,pbuf+sizeof(RecordFileHead_TypeDef),y);
		if(y!=RecordFileHead->LEN_DATA)
		{//写错误
			y=AutoDeleteFile(filename);//自动删除记录文件(自动减少存储深度);入口:写入文件时空间不够的文件名,以判别是RAM还是FLASH空间不够;返回:0=没删除,1=有删除
			if(y)
			{//有删除
				continue;
			}
			return;
		}
		break;
	}
	i+=y;
	file->LEN_DATA=i;
	
	//写地址列表
	ms->msfile_write(filename,x*sizeof(RecordFileHead_TypeDef),pbuf,sizeof(RecordFileHead_TypeDef));
	//数据数+1
	x++;
	file->NUM_DATA=x;
	
	//主动上报
	i=MRR(ADDR_4300_8+1,1);
	if(i==0)
	{//不允许主动上报
		for(i=0;i<NUMmax_601C;i++)
		{
		#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
			file->NUM_GPRSreport[i]=x;
			file->NUM_ENETreport[i]=x;
		#else
			file->NUM_GPRSorENETreport[i]=x;
		#endif
		}
	}
	else
	{//允许主动上报
		i=UARTCtrl->TaskID;//当前采集任务ID;值0表示无采集任务;b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
		if(((i>>24)&0xf)==2)
		{//方案类型=事件采集方案
			i&=0xff;//方案号
			i*=LENper_6016;
			i+=ADDR_6016_SDRAM;
			p8=Get_Element((u8 *)i,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8)
			{
				if(p8[1]==0)//上报标识        bool（True：立即上报，False：不上报），
				{//不上报
					for(i=0;i<NUMmax_601C;i++)
					{
					#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
						file->NUM_GPRSreport[i]=x;
						file->NUM_ENETreport[i]=x;
					#else
						file->NUM_GPRSorENETreport[i]=x;
					#endif
					}
					return;
				}
			}
		}
		
	#if ((USER/100)==15)//安微系
		i=UARTCtrl->TaskID;//当前采集任务ID;值0表示无采集任务;b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
		i>>=8;
		i&=0xff;
		if(i==49||i==28||i==54)
		{//任务号49抄表仅用于电压合笴率计算不需上报
			for(i=0;i<NUMmax_601C;i++)
			{
			#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
				file->NUM_GPRSreport[i]=x;
				file->NUM_ENETreport[i]=x;
			#else
				file->NUM_GPRSorENETreport[i]=x;
			#endif
			}
		}
	#endif		
		//上报通道
		REPORT_PORTn(file);//通道不需上报时置已上报数据个数=当前数据个数；使用ADDR_DATABUFF
	}
	
}










